{
    "name": "Janne Enberg",
    "contact": "<a href='tel:+358440851855'>+358 (0) 440 851 855</a> <a href='mailto:janne.enberg@lietu.net'>janne.enberg@lietu.net</a> <a href='http://lietu.net'>http://lietu.net/</a>",
    "mainHeading": "General",

    "sections": [

        {
            "title": "Personal Information",
            "fields": [
                ["Name", "Janne Enberg"],
                ["Date of Birth", "31<sup>st</sup> of January, 1985"],
                ["Languages", "Finnish (mother tongue), English (fluent in conversation and writing, including IT terminology)"],
                ["Hobbies", "Hydroponics, photography, cosmology, theoretical physics, Arduinos, network security, operating systems, hardware diagnostics, server administration and programming"]
            ]
        },

        {
            "title": "Summary",
            "largeList": [
                "Self-taught IT generalist with experience of working in all fields of software development, including architecture design, development, optimization, debugging, documentation, testing, maintenance, and customer support.",
                "Long history in *nix server set up and administration for various purposes, including securing servers.",
                "Reliable professional, open for innovation, able to handle stressful projects with deadlines and ad-hoc situations.",
                "Started doing everything related to computers at a young age, having used 20+ programming/scripting languages and 10+ operating systems, NOT including all variants and different distributions.",
                "Fast at learning new things, always looking to improve on tools currently in use, good endurance for keeping at it when working with difficult problems.",
                "Most important things at work are that it must be challenging enough, it must be something that one can be proud of, and there must be ample opportunity to learn new things.",
                "Elected to be health and safety representative (työsuojeluvaltuutettu) in Nord Software and Pryte."
            ]
        },

        {
            "title": "Experience Summary",
            "largeList": [
                "Long history at LAMP (Linux, Apache, MySQL, PHP) development, lately focused on DevOps things and switched to mainly programming in Python and some JavaScript (Node.js).",
                "Solid knowledge in database structure design gained through experience in making database intensive software and lectures by MySQL consultants. Debugging performance issues, optimization through means such as proper use of indexes and using temporary tables, keeping of historical data for logging purposes, and tuning configuration.",
                "Great experience in optimization of web-based software used world-wide, with up to 800 000 visits per day. This includes use of caching technologies (such as Memcached), caching servers (Varnish), and optimizations of multiple different layers.",
                "History of managing larger environments (dozens of servers) and ensuring high availability and scalability using various means.",
                "Experienced in agile software development methodologies (including Scrum), server administration tasks (including debugging performance and configuration issues), automation (incl. continuous integration and delivery systems), as well as automated testing."
            ]
        },

        {
            "title": "Technical skills",
            "fields": [
                ["Programming languages", "Python, Bash Shell, JavaScript (async + OOP, Node.js), PHP (OOP), C++ (OOP), Lua and more"],
                ["Other languages", "HTML, CSS, LESS, SQL"],
                ["Operating systems", "Linux (CentOS, Debian/Ubuntu, many more), FreeBSD, OpenBSD, Windows (not for server use)"],
                ["DevOps tools", "Jenkins, Travis CI, Vagrant, Chef, SaltStack, VMware (incl. ESXi), VirtualBox, Fabric, and of course custom tools"],
                ["Hardware", "System assembly, troubleshooting, configuration choosing"],
                ["Data", "MySQL, MongoDB, Cassandra, Redis, Riak, memcache, Sphinx, SOLR"],
                ["Security", "nmap, Nessus, AIDE, rkhunter, chkrootkit, snort, iptables, pf"],
                ["Networking", "IPSec (racoon, openswan), OpenVPN, tcpdump, Wireshark, TCP tuning"],
                ["Other", "Amazon Web Services (EC2, VPC, RDS, S3, Route 53, SES, ...), Nginx, Apache, varnish, Zabbix, Splunk, Git, Mercurial, SVN"]
            ]
        },


        "-",


        "Employment History",

        {
            "title": "Pryte (DevOps Lead)",
            "duration": "Started November 2013 (Current)",
            "large": "<p>At Pryte I took over managing the infrastructure (mostly AWS), continuous integration and delivery systems, and ensuring infrastructure security.</p><p>While writing Chef recipes for various purposes, I worked to improve the recipe collection, introducing testing and quality management tools (Vagrant, foodcritic) and taking into use common best practices.</p><p>I wrote lots of custom tools, e.g.:</p><ul><li>Bootstrapping new servers</li><li>Launching complete staging environments on demand (AWS EC2)</li><li>Managing infrastructure-wide strict firewall automatically based on mix of a configuration file and automatic server detection via Chef searches</li><li>Automatic backups of critical servers</li><li>Doing server healthchecks</li><li>Collecting monitoring data with adapters to different systems (CopperEgg and Zabbix)</li><p>I also wrote the background task queue system responsible e.g. for signing APKs.</p><p>I was also involved in designing system architecture and features.</p>"
        },

        {
            "title": "Kiosked (Senior Software Engineer)",
            "duration": "March 2013 - November 2013",
            "large": "<p>At Kiosked I worked on a wide variety of things, some of them being:</p><ul><li>The functionalities responsible for importing millions of products and then choosing the best matches to show for end users.</li><li>Implementing many improvements to the core systems and important tools for developers.</li><li>Profiling and optimizing the application core and servers, including implementation of custom tools for profiling and debugging.</li><li>Actively introducing new technologies to the system and developers.</li></ul><p>I also was a part of the 24/7 on call team making sure the systems were up and running always.</p>"
        },

        {
            "title": "Nord Software (Senior Software Engineer)",
            "duration": "March 2009 - March 2013",
            "large": "<p>In addition to the previous responsibilities as a software engineer, I was given responsibility of leading or supervising several development teams. I also participated in regular discussions about how to improve things in the company, ranging from employee happiness in general, to taking new technologies in use.</p><p>I have participated in some way in most projects at Nord Software, sometimes just for quick technical consultancy in design or to resolve issues, sometimes I was a one-man project team.</p><p>I also took care of some common tasks around the office, such as making sure more sodas are ordered in time to keep the programmers well hydrated.</p>"
        },

        {
            "title": "Nord Software (Software Engineer)",
            "duration": "August 2007 - March 2009",
            "large": "<p>I have had a wide array of responsibilities at Nord Software. These have included integrating secure communications to payment gateways, profiling and optimizing lots of software projects, choosing the appropriate hardware and software stacks, software and database architecture design, customer contact and project planning.</p><p>Server configuration choosing as well as communicating with the hosting partners to pick the various software stacks has also been one of the tasks most commonly assigned to me.</p><p>Some keywords: Web application development, database design, MySQL query & server optimization, LAMP stack optimization, software optimization, server administration, PHP, JavaScript, C++, HTML, CSS, Linux, Apache, MySQL, Nginx, Varnish, Memcache, etc.</p>"
        },


        "Projects from Nord Software",


        {
            "title": "Case DI",
            "duration": "December 2012 - March 2013",
            "fields": [
                ["Environment", "LAMP environment, SOAP"],
                ["Technologies", "Bash Shell, JavaScript, MySQL, PHP, Bootstrap, Drupal"],
                ["Role", "Senior software engineer, database and software architecture designer, integrations"],
                ["Team Size", "5"]
            ],
            "large": "<p>Case DI is an employee portal for highly qualified professionals. The portal included SOAP integration with an application for keeping information of available jobs and applying for them, as well as creating a SOAP authentication API for communication with another application.</p>"
        },


        "-",

        {
            "title": "Case W",
            "duration": "July 2011 - March 2013",
            "fields": [
                ["Environment", "LAMP environment, LDAP"],
                ["Technologies", "Bash Shell, JavaScript, MySQL, PHP, LDAP, Bootstrap, Yii"],
                ["Role", "Senior software engineer, database and software architecture designer, core component developer"],
                ["Team Size", "2"]
            ],
            "large": "<p>Case W is a work shift planning and scheduling system with LDAP integration. The application can be used to first plan requirements for staffing in different teams at different times, and those requirements can easily be used to plan each employee's weekly schedules. Employees can also use the application to request vacation, track their vacation day usage, notify the team managers about sick leave, and request to switch shifts with other employees.</p><p>The software scales well from the needs of a small team to the needs of a company with hundreds of employees. The system is also highly customizable and features a custom-built JavaScript application structure and several larger JavaScript-driven UI components used for planning the weekly and daily schedules.</p>"
        },

        {
            "title": "Case L",
            "duration": "July 2012 - October 2012",
            "fields": [
                ["Environment", "LAMP environment"],
                ["Technologies", "JavaScript, MySQL, PHP, Bootstrap, Yii"],
                ["Role", "Team lead, database and software architecture designer, project manager"],
                ["Team Size", "2"],
                ["Responsibilities", "Development, database design, software and server optimization, core components, payment systems, customer contact"]
            ],
            "large": "<p>Case L was an online e-commerce site, that was given a full frontend rewrite, while only doing some improvements on the already existing backend software. The frontend was given a much more modern responsive layout, with several interactive JavaScript components, while trying to keep a familiar and comfortable feel to the site for the existing customers.</p><p>An easy to integrate and extensible payment system module was done for the project, so future projects can benefit from it as well.</p>"
        },


        {
            "title": "Case D",
            "duration": "October 2011 - October 2012",
            "fields": [
                ["Environment", "LAMP environment"],
                ["Technologies", "C++, Bash Shell"]
            ],
            "large": "<p>Case D was a multi-threaded C++ application created to handle time-critical actions on a high-traffic site that needs to deliver real-time data to all of their clients. The application was built from scratch, fully customized to the needs of the client, with focus on stability, performance, scalability and readability of the code. The application is capable of automatically recovering even from many severe errors without affecting the site, it is easy to debug and profile, and scales easily by sharding and includes a simple high availability implementation.</p><p>Case D was handled as a one-man project, for both customer contact and technical implementation.</p>"
        },

        {
            "title": "Case B",
            "duration": "April 2009 - December 2011",
            "fields": [
                ["Environment", "Large LAMP environment, Memcached, MongoDB, Varnish, nginx"],
                ["Technologies", "Bash Shell, C++, JavaScript, MySQL, PHP"],
                ["Role", "Team lead, senior software engineer, database and software architecture designer"],
                ["Team Size", "Has varied between 2 and 9"],
                ["Responsibilities", "Development, database design, software and server optimization, and security auditing "]
            ],
            "large": "<p>Case B was creating a world-wide high profile internet based site, with real-time data and payment system integrations from scratch. The servers, software and database were heavily optimized to serve a large amount of clicks per day, while still keeping the data real-time. Several different payment systems were integrated, and several security systems were created to ensure transaction integrity. The database was also been designed to keep the system robust, while making sure that all data was preserved.</p><p>Case B served up to 800 000 visitors and a few million page views per day.</p>"
        },


        "-",

        {
            "title": "Case M",
            "duration": "November 2008 - September 2009",
            "fields": [
                ["Environment", "Large LAMP environment, Memcached, MongoDB, Varnish, nginx"],
                ["Technologies", "JavaScript, MySQL, pdflib, PHP"],
                ["Role", "Team lead, software engineer, database and software architecture designer, customer support"],
                ["Team Size", "2"],
                ["Responsibilities", "Development, database design, architecture design, optimization, and customer support"]
            ],
            "large": "<p>Case M was a web-based marketing management tool. With the application, large organizations are able to manage, organize and supervise their marketing investments on all organizational levels and business activities. The application uses pdflib to generate PDF reports with graphs.</p>"
        },

        {
            "title": "Case S",
            "duration": "May 2008 - April 2009",
            "fields": [
                ["Environment", "LAMP"],
                ["Technologies", "JavaScript, MySQL, PHP"],
                ["Role", "Software engineer, architecture designer, customer support"],
                ["Team Size", "4"],
                ["Responsibilities", "Development, database design, architecture design, and optimization"]
            ],
            "large": "<p>Case S was an online consumer behavior surveying application. It enables creation and fielding of multimedia-enriched surveys. The application is designed to run on all browsers all the way back to IE6. The surveys are completely executed client side, in the browser, to reduce the server load. A communication framework relays the gathered data to the server side IO API.</p>"
        },


        {
            "title": "PHP Framework",
            "duration": "September 2007 - December 2011",
            "fields": [
                ["Technologies", "PHP"],
                ["Responsibilities", "Architecture design and optimization"]
            ],
            "large": "<p>PHP Framework was at one time the base used for most of Nord Software's PHP projects. This system was been built for performance and rapid application development.</p><p>Eventually the PHP framework was retired and replaced in most projects with the Yii PHP Framework.</p>"
        },

        {
            "title": "Case E",
            "duration": "August 2007 - September 2009",
            "fields": [
                ["Environment", "LAMP"],
                ["Technologies", "JavaScript, MySQL, pdflib, PHP, SOAP"],
                ["Role", "Software engineer, customer support"],
                ["Team Size", "2"],
                ["Responsibilities", "Architecture design and optimization"]
            ],
            "large": "<p>Case E was a tool for measuring, planning and managing the corporate relationships in companies working in a project-based or business-to-business environment. The software used a wide variety of technologies, for example pdflib to generate extensive PDF reports with graphs, and SOAP to communicate and transmit collected data to Salesforce.</p>"
        },


        "-",

        "Noteworthy personal projects",

        {
            "title": "JSIS",
            "fields": [
                ["Technologies", "JavaScript, Node.js"],
                ["Project homepage", "<a href=\"http://jsis.name/\">http://jsis.name/</a>"]
            ],
            "large": "<p>JSIS is short for JavaScript IRC Stats. It is a tool to generate statistics from Internet Relay Chat log files. The tool was built due to frustration with existing tools and to have fun while learning Node.js.</p><p>The tool is well documented, and the code is structured so adding support for more log file formats, new statistical widgets, and themes is easy.</p>"
        },

        {
            "title": "Other project links",
            "fields": [
                ["Code released on homepage", "<a href=\"http://lietu.net/blog.html\">http://lietu.net/blog.html</a>"],
                ["GitHub repositories", "<a href=\"https://github.com/lietu?tab=repositories\">https://github.com/lietu</a>"],
                ["Google Code profile", "<a href=\"http://code.google.com/u/115444436386238448327/\">http://code.google.com/u/115444436386238448327/</a>"],
                ["SourceForge profile", "<a href=\"http://sourceforge.net/users/lietu\">http://sourceforge.net/users/lietu</a>"]
            ]
        }
    ]

}
